---
kind: method
id: M:Autodesk.Revit.DB.ParameterDownloadOptions.GetGroupTypeId
source: html/2235eeb4-9006-2a7e-404c-78c3b20338fd.htm
---
# Autodesk.Revit.DB.ParameterDownloadOptions.GetGroupTypeId Method

Get properties palette group identifier.

## Syntax (C#)
```csharp
public ForgeTypeId GetGroupTypeId()
```